CSI API ETABS v1
cPropMaterial Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cPropMaterial
Public Interface cPropMaterial
Dim instance As cPropMaterial
public interface class cPropMaterial
type cPropMaterial =  interface end
The cPropMaterial type exposes the following members.
Properties
Name | Description
TimeDep
 API calls for time dependent material properties.
Top
Methods
Name | Description
AddMaterial
 Adds a new material property to the model.
ChangeName
 Changes the name of an existing material property.
Count
 Gets the total number of defined material properties in the model. If desired, counts can be returned for all material properties of a specified type in the model.
Delete
 Deletes a specified material property.
GetDamping
 Retrieves the additional material damping data for the material.
GetMassSource
 DEPRECATED Retrieves the mass source for the model.
GetMassSource_1
 Retrieves the mass source for the model.
GetMaterial
 Retrieves some basic material property data.
GetMPAnisotropic
 Retrieves the mechanical properties for a material with an anisotropic directional symmetry type.
GetMPIsotropic
 Retrieves the mechanical properties for a material with an isotropic directional symmetry type.
GetMPOrthotropic
 Retrieves the mechanical properties for a material with an orthotropic directional symmetry type.
GetMPUniaxial
 Retrieves the mechanical properties for a material with an uniaxial directional symmetry type.
GetNameList
 Retrieves the names of all defined material properties of the specified type.
GetOConcrete
 (NEWER FUNCTION AVAILABLE) Retrieves the other material property data for concrete materials.
GetOConcrete_1
 Retrieves the other material property data for concrete materials.
GetONoDesign
 Retrieves the other material property data for no design type materials.
GetORebar
 (NEWER FUNCTION AVAILABLE) Retrieves the other material property data for rebar materials.
GetORebar_1
 Retrieves the other material property data for rebar materials.
GetOSteel
 (NEWER FUNCTION AVAILABLE) Retrieves the other material property data for steel materials.
GetOSteel_1
 Retrieves the other material property data for steel materials.
GetOTendon
 (NEWER FUNCTION AVAILABLE) Retrieves the other material property data for tendon materials.
GetOTendon_1
 Retrieves the other material property data for tendon materials.
GetSSCurve
 Retrieves the material stress-strain curve.
GetTemp
 Retrieves the temperatures at which properties are specified for a material.
GetTypeOAPI
GetWeightAndMass
 Retrieves the weight per unit volume and mass per unit volume of the material.
SetDamping
 Sets the additional material damping data for the material.
SetMassSource
 DEPRECATED Sets the mass source for the model.
SetMassSource_1
 Sets the mass source for the model.
SetMaterial
 DEPRECATED. Initializes a material property. If this function is called for an existing material property, all items for the material are reset to their default value.
SetMPAnisotropic
 Sets the material directional symmetry type to anisotropic, and assigns the anisotropic mechanical properties.
SetMPIsotropic
 Sets the material directional symmetry type to isotropic, and assigns the isotropic mechanical properties.
SetMPOrthotropic
 Sets the material directional symmetry type to orthotropic, and assigns the orthotropic mechanical properties.
SetMPUniaxial
 Sets the material directional symmetry type to uniaxial, and assigns the uniaxial mechanical properties.
SetOConcrete
 (NEWER FUNCTION AVAILABLE) Sets the other material property data for concrete materials.
SetOConcrete_1
 Sets the other material property data for concrete materials.
SetONoDesign
 Sets the other material property data for no design type materials.
SetORebar
 (NEWER FUNCTION AVAILABLE) Sets the other material property data for rebar materials.
SetORebar_1
 Sets the other material property data for rebar materials.
SetOSteel
 (NEWER FUNCTION AVAILABLE) Sets the other material property data for steel materials.
SetOSteel_1
 Sets the other material property data for steel materials.
SetOTendon
 (NEWER FUNCTION AVAILABLE) Sets the other material property data for tendon materials.
SetOTendon_1
 Sets the other material property data for tendon materials.
SetSSCurve
 Sets the material stress-strain curve for materials that are specified to have user-defined stress-strain curves.
SetTemp
 assigns the temperatures at which properties are specified for a material. This data is required only for materials whose properties are temperature dependent.
SetWeightAndMass
 Assigns weight per unit volume or mass per unit volume to a material property.
Top
See Also
Reference
ETABSv1 Namespace